UnsignedArduino/ESP32-Camera/lib/ESP32_Camera_GUI/ESP32_Camera_GUI.cpp
  fontY += charHeight * 1.5;

  const uint8_t scrollBarX = boxX + boxWidth - charWidth;
  const uint8_t scrollBarY = fontY;
  const uint8_t scrollBarWidth = charWidth / 2;
  const uint8_t scrollBarHeight = maxEntryPerPage * charHeight;

  DateTime beforeModification = this->rtc->now();
  uint32_t startTimeInSelector = millis();

  // 0 = year, 1 = month, 2 = day, 3 = hour, 4 = minute, 5 = second
  uint8_t selectedSpan = 0;
  bool isEditing = false;

  while (true) {
    DateTime now = this->rtc->now();

    const uint8_t numberCount = 6;
    const uint16_t numbers[numberCount] = {now.year(),   now.month(),
                                           now.day(),    now.hour(),
                                           now.minute(), now.second()};
    const char* numberFormat[numberCount] = {"%d", "%d",   "%d",
                                             "%d", "%.2d", "%.2d"};
    const char* numberFormatTrail[numberCount] = {"/", "/", " ",
                                                  ":", ":", "  "};

    uint8_t currentCharX = 0;

    this->tft->setCursor(fontX + charWidth, fontY + charHeight);

    for (uint8_t i = 0; i < numberCount; i++) {
      if (selectedSpan == i && isEditing) {
        this->tft->setTextColor(boxColor, textColor);
      } else {
        this->tft->setTextColor(textColor, boxColor);
      }
      const size_t bufSize = 8;
      char buf[bufSize];
      memset(buf, 0, bufSize);
      snprintf(buf, bufSize, numberFormat[i], numbers[i]);
      this->tft->print(buf);
      this->tft->drawFastHLine(
        fontX + charWidth + currentCharX * charWidth,
        fontY + charHeight * 2 + 1, charWidth * strlen(buf),
        selectedSpan == i && !isEditing ? textColor : boxColor);
      currentCharX += strlen(buf);
      this->tft->setTextColor(textColor, boxColor);
      this->tft->print(numberFormatTrail[i]);
      currentCharX += strlen(numberFormatTrail[i]);
    }

    this->tft->setCursor(fontX + charWidth, fontY + charHeight * 3);
    if (selectedSpan == 6) {
      this->tft->setTextColor(boxColor, textColor);
    } else {
      this->tft->setTextColor(textColor, boxColor);
    }
    this->tft->print("Save and exit");

    this->tft->setCursor(fontX + charWidth, fontY + charHeight * 4);
    if (selectedSpan == 7) {
      this->tft->setTextColor(boxColor, textColor);
    } else {
      this->tft->setTextColor(textColor, boxColor);
    }
    this->tft->print("Cancel and exit");

    this->drawBottomToolbar();

    while (millis() - lastMovedTime < moveThrottleTime) {
      delay(1);
    }

    uint32_t startWait = millis();

    while (true) {
      this->drawBottomToolbar();

      if (!this->upButton->read() || !this->downButton->read()) {
        if (lastPressTime > 0) {
          pressTime += millis() - lastPressTime;
        }
        lastPressTime = millis();
      } else {
        pressTime = 0;
        lastPressTime = 0;
      }
      if (this->upButton->pressed() ||
          (!this->upButton->read() && pressTime > holdToAccelTime)) {
        if (isEditing) {
          DateTime now = this->rtc->now();
          switch (selectedSpan) {
            default: {
              break;
            }
            case 0: {  // year
              DateTime target =
                DateTime(now.year() + 1, now.month(), now.day(), now.hour(),
                         now.minute(), now.second());
              if (!target.isValid()) {
                target = target + TimeSpan(1, 0, 0, 0);
              }
              this->rtc->adjust(target);
              break;
            }
            case 1: {  // month
              DateTime target =
                DateTime(now.year(), now.month() + 1, now.day(), now.hour(),
                         now.minute(), now.second());
              if (!target.isValid()) {
                target = target + TimeSpan(1, 0, 0, 0);
              }
              this->rtc->adjust(target);
              break;
            }
            case 2: {  // day
              this->rtc->adjust(now + TimeSpan(1, 0, 0, 0));
              break;
            }
            case 3: {  // hour
              this->rtc->adjust(now + TimeSpan(0, 1, 0, 0));
              break;
            }
            case 4: {  // minute
              this->rtc->adjust(now + TimeSpan(0, 0, 1, 0));
              break;
            }
            case 5: {  // second
              this->rtc->adjust(now + TimeSpan(0, 0, 0, 1));
              break;
            }
          }
        } else {
          if (selectedSpan == 0) {
            selectedSpan = 7;
          } else {
            selectedSpan--;
          }
        }
        break;
      }
      if (this->downButton->pressed() ||
          (!this->downButton->read() && pressTime > holdToAccelTime)) {
        if (isEditing) {
          DateTime now = this->rtc->now();
          switch (selectedSpan) {
            default: {
              break;
            }
            case 0: {  // year
              DateTime target =
                DateTime(now.year() - 1, now.month(), now.day(), now.hour(),
                         now.minute(), now.second());
              if (!target.isValid()) {
                target = target - TimeSpan(1, 0, 0, 0);
              }
              this->rtc->adjust(target);
              break;
            }
            case 1: {  // month
              DateTime target =
                DateTime(now.year(), now.month() - 1, now.day(), now.hour(),
                         now.minute(), now.second());
              if (!target.isValid()) {
                target = target - TimeSpan(1, 0, 0, 0);
              }
              this->rtc->adjust(target);
              break;
            }
            case 2: {  // day
              this->rtc->adjust(now - TimeSpan(1, 0, 0, 0));
              break;
            }
            case 3: {  // hour
              this->rtc->adjust(now - TimeSpan(0, 1, 0, 0));
              break;
            }
            case 4: {  // minute
              this->rtc->adjust(now - TimeSpan(0, 0, 1, 0));
              break;
            }
            case 5: {  // second
              this->rtc->adjust(now - TimeSpan(0, 0, 0, 1));
              break;
            }
          }
        } else {
          if (selectedSpan == 7) {
            selectedSpan = 0;
          } else {
            selectedSpan++;
          }
        }
        break;
      }
      if (this->selectButton->pressed()) {
        if (selectedSpan <= 5) {
          isEditing = !isEditing;
          break;
        } else if (selectedSpan == 6) {
          return true;
        } else {
          this->rtc->adjust(beforeModification +
                            TimeSpan(startTimeInSelector / 1000));
          return false;
        }
      }
      if (millis() - startWait > maxActionWaitTime) {
        break;
      }
    }

    lastMovedTime = millis();
  }
}

